Tekla.Structures.Plugins.PropertyPane.PropertyPaneType
The property pane type enum.

Tekla.Structures.Plugins.PropertyPane.PropertyPaneType.Plugin
The plugin type.

Tekla.Structures.Plugins.PropertyPane.PropertyPaneType.CustomPart
The custom part type.

Tekla.Structures.Plugins.PropertyPane.PropertyPaneType.Connection
The connection type.